# Отчёт о тестировании "Money Transfer"

## Краткое описание

Дата начала 24.10.2021 - Дата окончания 24.10.2021 было проведено модульное, smoke тестирование приложения Money Transfer.

На тестирование затрачено: 1,5 часа

## В результате тестирования выявлены следующие дефекты:

При пополнении банковского счёта клиента, итоговая сумма становится отрицательной [ссылка на отчёт ](https://github.com/DmitriyVlz/Introduction-in-Java_1.1/issues/1#issue-1034439032).


## Описание процесса тестирования

### В процессе тестирования использовались следующие артефакты :

 Входные данные: 
текущий баланс счёта клиента - переменная типа int, значение - 2_000_000_000 (два миллиарда рублей) сумма перевода - переменная типа int, значение - 500_000_000 (пятьсот миллионов рублей) переменная для хранения итогового значения - тип int Создать базовое приложение (на основании примера, который рассматривался на лекции), позволяющее воспроизвести ситуацию.
 Пример:

 ``` java
 public class Main { public static void main(String[] args) 
 { int price = 150;
   int count = 5;
   int total = price * count; 
   System.out.println(total); }
   }
 ```

В качестве тестовых данных использовались данные из Домашнее задание к занятию «1. Введение в Java», Задача №1 - Money Transfer, пример, который рассматривался на лекции



## Тестирование производилось в следующем окружении:

Windows 10 Pro

версия Java 11.0.12

IntelliJ IDEA Community Edition
